tutorials/mesh/snappyHexMesh/iglooWithFridges/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 265;

boundaryField
{
    ground
    {
        type            fixedValue;
        value           uniform 265;
    }

    igloo_region0
    {
        type            fixedValue;
        value           uniform 265;
    }

    twoFridgeFreezers_seal_0
    {
        type            fixedValue;
        value           uniform 303;
    }

    twoFridgeFreezers_herring_1
    {
        type            fixedValue;
        value           uniform 303;
    }
}


// ************************************************************************* //
